 * データを情報とする方法の一つ = データ全体の様子(特徴)を捉えること  
 * データがどんな値をとっているか  
 * データがどのようにばらついているか  
 * データがどの程度ばらついているか  
 * データを分析するための観点「分布」
 * １つの値or値の範囲に対する[件数]
 * データの種類によって、適切な件数の数え方を選択する
 * 性別や血液型のような「分類」⇒分類ごとのデータ件数を数える
 * 身長や体重のような「数値」のデータ→値あるいは値の範囲を指定してデータ件数を数える  
 →分析の方法も、データの種類によって異なる  
 →まずは「データの種類」を識別することが重要  
 
 ### 統計のフロー
 1. 解決したい問題を整理する
 2. 調査方法、実験方法を設計する
 3. データを収集し、整理する
 4. データを分析する
 5. 分析結果から結論を出す
 ### 目標
 1. 問題解決のプロセスを理解する
 2. データの集め方が適切であるかどうかに言及できる
 3. データ分析の手法を説明できる
 4. 分析結果の解釈について説明し、自分の意見をまとめることができる
### 統計の種類
1. 記述統計  
手元にあるデータを全体ととらえ、結論を出す。
2. 推測統計  
手元にあるデータを全体の一部分ととらえ、  
分析結果から全体の状態を推測し結論付ける。
## その他  
技術はお金と同じく、持っている人の所に集まる。  
技術はお金と異なり、総量がない。  
